Revit 2022 API
ParameterTypeId.RbsElecDistributionNodePowerSource Property
 "Power Source"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public static ForgeTypeId RbsElecDistributionNodePowerSource { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecDistributionNodePowerSource As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecDistributionNodePowerSource {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace